w7/d2/MusicApp/app/controllers/application_controller.rb

  def current_user
    users_token = session[:session_token]
    current_user = User.find_by(session_token: users_token)
---
SELECT  "users".* FROM "users" WHERE "users"."session_token" = $1 LIMIT $2  [["session_token", "CCSdFdRzI1GrJwy0GRYbLg"], ["LIMIT", 1]]

  def logged_in?
    user = User.find_by(session_token: session[:session_token])
---
SELECT  "users".* FROM "users" WHERE "users"."session_token" = $1 LIMIT $2  [["session_token", "CCSdFdRzI1GrJwy0GRYbLg"], ["LIMIT", 1]]