w7/d2/MusicApp/app/controllers/bands_controller.rb

  def create
    band = Band.new(band_params)
    if band.save
---
INSERT INTO "bands" ("name", "created_at", "updated_at", "location") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Golithe"], ["created_at", "2021-10-12 23:30:03.197253"], ["updated_at", "2021-10-12 23:30:03.197253"], ["location", "SC"]]

  def show
    begin
      band = Band.find(params[:id])
---
SELECT  "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]