w7/d2/MusicApp/app/models/user.rb

  def self.find_by_credentials(username, password)
    user = User.find_by(email: username)
---
SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "oz"], ["LIMIT", 1]]